---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Options Constructor
Options Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Options()()()() | Creates a default Options object. |
|  | Options(Options) | Copy constructor. |

# See Also

Options Class

Options Members

Autodesk.Revit.DB Namespace